% 矩阵为matlab的基本变量类型
% 一位数组即，一行的矩阵，也称作标量
%  本文件为普通脚本遵照固定格式，先清空工作区，后运行脚本命令
clear;
%% 矩阵的创建
A = [1 2 3 4;5 6 7 8;9 10 11 12];
%分号分割每一行
X = zeros(5); %5x5全零矩阵
X = zeros(3,4);%3x4全零矩阵
X = zeros([3 4]);%3x4全零阵
X = zeros(size(A));%生成与矩阵A相同大小的全零阵
X = ones(5);
X = ones(3,4);%与全零阵相似，ones代表生成全一阵
X = eye(5);%与全零阵相似，eye代表生成单位阵
%生成对角阵
Y = blkdiag(1,2,3,4,5,6,7,8,9,10);%括号中用逗号区分对角的元素
v =[1 2 3 4 5 6 7 8 9 10];
Z = diag(v);%以向量v作为对角元素
Z = diag(v,1);%以向量v作为对角元素，并对矩阵上移1位
%    0     1     0     0     0     0     0     0     0     0     0
%    0     0     2     0     0     0     0     0     0     0     0
%    0     0     0     3     0     0     0     0     0     0     0
%    0     0     0     0     4     0     0     0     0     0     0
%    0     0     0     0     0     5     0     0     0     0     0
%    0     0     0     0     0     0     6     0     0     0     0
%    0     0     0     0     0     0     0     7     0     0     0
%    0     0     0     0     0     0     0     0     8     0     0
%    0     0     0     0     0     0     0     0     0     9     0
%    0     0     0     0     0     0     0     0     0     0    10
%    0     0     0     0     0     0     0     0     0     0     0
Z = diag(v,-1);%以向量v作为对角元素，并对矩阵下移1位
%    0     0     0     0     0     0     0     0     0     0     0
%    1     0     0     0     0     0     0     0     0     0     0
%    0     2     0     0     0     0     0     0     0     0     0
%    0     0     3     0     0     0     0     0     0     0     0
%    0     0     0     4     0     0     0     0     0     0     0
%    0     0     0     0     5     0     0     0     0     0     0
%    0     0     0     0     0     6     0     0     0     0     0
%    0     0     0     0     0     0     7     0     0     0     0
%    0     0     0     0     0     0     0     8     0     0     0
%    0     0     0     0     0     0     0     0     9     0     0
%    0     0     0     0     0     0     0     0     0    10     0
M = magic(3);%产生魔方矩阵
%M =
%    8     1     6
%    3     5     7
%    4     9     2
%% 矩阵的元素操作
A(1,:);%提取A中第一行
A(:,2);%提取A中第二列
A(:);%提取A中每一列并整合成列向量
A(1:2,3:4);%提取A中1到2行，3到4列的子矩阵
%A(4:-1:2,:);
%A(:,3:-1:2);%索引超出矩阵维度。
B = A;
A(:,3:4)=[];%删除3到4列，构成新的矩阵
[A B];%连接矩阵，横向
A = B;
A(1:2,:)=[];%删除1到2行，构成新矩阵
[A;B];%连接矩阵，纵向